#include <iostream>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------





//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");
	
	//-------------------------------САМА ПРОГА-------------------------------------


	int a, b, c;

	cout << "Введите первое число: ";
	cin >> a;

	cout << endl << "Введите второе число: ";
	cin >> b;

	cout << endl << "Введите третье число: ";
	cin >> c;

	cout << endl;
	if (a == b || a == c || b == c)
	{
		cout << "первое число: " << a + 5 << endl;
		cout << "второе число: " << b + 5 << endl;
		cout << "третье число: " << c + 5 << endl;
	}
	else
	{
		cout << "Равных чисел НЕТ!" << endl;
	}





	system("pause");

	return 0;
}
